briches/OpenQuad2/fw/oq2/application/flight_app/esc_dfu/stm32_uart_dfu/stm32_uart_dfu.c
void stm_uart_dfu_rx_complete_callback(stm_uart_dfu_ctx* pctx, uint8_t rx_byte)
{
    pctx->buffer[pctx->received_byte_count] = rx_byte;

    // if(m_print_rx_chars)
        // debug_printf("Rx %02X", rx_byte);

    pctx->received_byte_count++;

    if (rx_byte == STM_DFU_ACK)
        pctx->received_ack_count++;

    pctx->waiting_for_rx = false;
}

/*********************************************************************************************/
/** Static Functions                                                                         */
/*********************************************************************************************/

/**
 * @brief Check the list of supported devices for the given produdct ID
 *
 * @param ID
 * @return stm32_dev_info_t*
 */
static stm32_dev_info_t* _stm_dfu_find_matching_device(uint16_t ID)
{
    uint32_t list_size = sizeof(mStm32DevInfoList) / sizeof(mStm32DevInfoList[0]);

    for (int i = 0; i < list_size; i++)
    {
        if (mStm32DevInfoList[i].ID == ID)
        {
            return (stm32_dev_info_t*)&mStm32DevInfoList[i];
        }
    }

    return NULL;
}

static uint32_t stm_dfu_info_get_page_from_addr(stm32_dev_info_t * pctx, uint32_t address) 
{
    if(address < pctx->flash_start || address > pctx->flash_end)
        return -1;

    return ((address - pctx->flash_start) / pctx->page_size);
}


/**
 * @brief Send data to the device using the provided abstraction function
 * 
 * @param pctx 
 * @param pdata pointer to data
 * @param length length of data
 * @param blocking Write using blocking API or not.
 */
static void _stm_dfu_device_send_(stm_uart_dfu_ctx* pctx, uint8_t* pdata, uint32_t length, bool blocking)
{
    pctx->tx_busy = true;
    pctx->waiting_for_rx = true;
    pctx->received_byte_count = 0;
    pctx->received_ack_count = 0;

    if(pctx->send_data(pctx->handle, pdata, length, blocking) != 0)
        debug_error("Problem sending data with interface function.");
}

/**
 * @brief Use the context's delay function and get_time fun
 * 
 * @param pctx 
 * @param acks 
 * @return true 
 * @return false 
 */
static bool _stm_dfu_timeout_on_acks(stm_uart_dfu_ctx* pctx, uint8_t acks)
{
    float now = pctx->get_time();

    while(pctx->received_ack_count < acks)
    {
        pctx->delay();

        if((pctx->get_time() - now) > pctx->timeout)
            return false;
    }

    return true;
}

/**
 * @brief Send the STM UART DFU Sync Character 0x7F to establish connection 
 * 
 * @param pctx 
 * @return uint32_t error code
 */
static uint32_t _stm_dfu_connect(stm_uart_dfu_ctx * pctx)
{
    uint32_t retval = STM_DFU_NO_ERROR;

    // Send sync character
    pctx->buffer[0] = STM_DFU_SYNC;
    _stm_dfu_device_send_(pctx, pctx->buffer, 1, NON_BLOCKING_INTERFACE_TX);

    // Wait for response. A single ack confirms that we have established communication 
    if(_stm_dfu_timeout_on_acks(pctx, 1) == false)
        return STM_DFU_ERROR_TIMEOUT;

    debug_printf("Got first ACK.");
    retval = STM_DFU_NO_ERROR; // NO error, keep going.
    pctx->state = UART_DFU_STATE_VERSION;

    return retval;
}

static uint32_t _stm_dfu_get_version(stm_uart_dfu_ctx* pctx)
{
    uint32_t retval = STM_DFU_NO_ERROR;

    pctx->buffer[0] = STM_DFU_CMD_GET;
    pctx->buffer[1] = ~pctx->buffer[0];

    _stm_dfu_device_send_(pctx, pctx->buffer, 2, NON_BLOCKING_INTERFACE_TX);

    // Wait for response. A start and finish ACK
    if(_stm_dfu_timeout_on_acks(pctx, 2) == false)
        return STM_DFU_ERROR_TIMEOUT;

    // Handle response
    uint8_t num_bytes = pctx->buffer[1];
    uint8_t version = pctx->buffer[2];

    pctx->version_major = (version & 0xF0) >> 4;
    pctx->version_minor = (version & 0x0F) >> 0;

    debug_printf("DFU version %X.%X", pctx->version_major, pctx->version_minor);
    debug_printf("Parsing command list.");

    // The rest of the bytes here are the list of supported commands.
    // Check for support of the Extended Erase command
    for (int i = 0; i < num_bytes; i++)
    {
        if (pctx->buffer[3 + i] == STM_DFU_CMD_EX_ERASE)
        {
            pctx->use_extended_erase = true;
            debug_printf("Extended Erase supported.");
        }
        if (pctx->buffer[3 + i] == STM_DFU_CMD_ERASE)
        {
            pctx->use_extended_erase = true;
            debug_printf("Erase supported.");
        }
    }

    pctx->state = UART_DFU_STATE_VERSION_RP;

    retval = STM_DFU_NO_ERROR;

    return retval;
}

static uint32_t _stm_dfu_get_version_read_protect(stm_uart_dfu_ctx* pctx)
{
    uint32_t retval = STM_DFU_NO_ERROR;

    // Fill buffer with the command and CRC
    pctx->buffer[0] = STM_DFU_CMD_GET_RP_STAT;
    pctx->buffer[1] = ~pctx->buffer[0];

    _stm_dfu_device_send_(pctx, pctx->buffer, 2, NON_BLOCKING_INTERFACE_TX);

    // Wait for response. A start and finish ACK
    if(_stm_dfu_timeout_on_acks(pctx, 2) == false)
        return STM_DFU_ERROR_TIMEOUT;

    // Handle response
    uint8_t boot_version = pctx->buffer[1];
    uint8_t option1 = pctx->buffer[2];
    uint8_t option2 = pctx->buffer[3];

    debug_printf("RP Boot version %u.%u", (boot_version >> 4), (boot_version & 0x0f));
    debug_printf("option bytes: %u %u", option1, option2);

    pctx->state = UART_DFU_STATE_GET_ID;

    retval = STM_DFU_NO_ERROR;
    
    return retval;
}

static uint32_t _stm_dfu_get_device_id(stm_uart_dfu_ctx* pctx)
{
    uint32_t retval = STM_DFU_NO_ERROR;

    pctx->buffer[0] = STM_DFU_CMD_GET_ID;
    pctx->buffer[1] = ~pctx->buffer[0];

    _stm_dfu_device_send_(pctx, pctx->buffer, 2, NON_BLOCKING_INTERFACE_TX);

    // Wait for response. A start and finish ACK
    if(_stm_dfu_timeout_on_acks(pctx, 2) == false)
        return STM_DFU_ERROR_TIMEOUT;

    // Parse product ID
    uint16_t ID = (pctx->buffer[2]) << 8 | pctx->buffer[3];

    debug_printf("PID 0x%X", ID);

    // Check our known list of IDs for a match.
    pctx->pdev_info = _stm_dfu_find_matching_device(ID);

    // Match not found
    if (pctx->pdev_info == NULL)
    {
        debug_error("Device 0x%X not found in list.");
        retval = STM_DFU_ERROR_DEVICE_NOT_FOUND;
        pctx->state = UART_DFU_STATE_ERROR;
    }
    else
    {
        debug_printf("%s identified!", pctx->pdev_info->name);
        retval = STM_DFU_NO_ERROR;
        pctx->state = UART_DFU_STATE_IDLE;
    }

    return retval;
}


/*********************************************************************************************/
/** API                                                                                      */
/*********************************************************************************************/
/**
 * @brief Initialize the bootloader context using the provided buffer and
 * interface functions
 *
 * @param pctx pointer to context
 * @return uint32_t write data error code according to interface function definition
 */
uint32_t stm_uart_dfu_init(stm_uart_dfu_ctx* pctx)
{
    uint32_t retval = STM_DFU_NO_ERROR;

    pctx->received_ack_count = 0;

    // Set up the context
    memset(pctx->buffer, 0x00, pctx->buffer_size);
    pctx->state = UART_DFU_STATE_INIT;
    pctx->pdev_info = NULL;
    pctx->received_byte_count = 0;
    pctx->received_ack_count = 0;
    pctx->use_extended_erase = false;

    // Send the start character to see if we can get a response.
    retval = _stm_dfu_connect(pctx);
    if(retval != STM_DFU_NO_ERROR)
        return retval;

    // Check the bootloader version with the GET command
    retval = _stm_dfu_get_version(pctx);
    if(retval != STM_DFU_NO_ERROR)
        return retval;

    // Check the read protect version 
    retval = _stm_dfu_get_version_read_protect(pctx);
    if(retval != STM_DFU_NO_ERROR)
        return retval;

    // Get the device ID.
    retval = _stm_dfu_get_device_id(pctx);
    if(retval != STM_DFU_NO_ERROR)
        return retval;

    return retval;
}


/**
 * @brief Erase flash based on address and number of bytes. Can only erase in units of the chips PAGE_SIZE
 * 
 * @param pctx DFU context
 * @param start_address Starting address to erase from. Will round down to the nearest page, sector, region
 * @param num_bytes NUmber of bytes to erase
 * @return uint32_t error code / result code based on or state of the uart DFU context
 */
uint32_t stm_uart_dfu_erase_flash(stm_uart_dfu_ctx* pctx, uint32_t start_address, uint32_t num_bytes)
{
    int32_t start_page = stm_dfu_info_get_page_from_addr(pctx->pdev_info, start_address);
    int32_t end_page = stm_dfu_info_get_page_from_addr(pctx->pdev_info, start_address + num_bytes - 1);

    debug_printf("Start page %u, end page %u", start_page, end_page);

