briches/OpenQuad2/fw/oq2/application/flight_app/esc_dfu/stm32_uart_dfu/stm32_uart_dfu.c
    if(start_page < 0 || end_page < 0)
        return STM_DFU_ERROR_INVALID_ADDRESS;

    // Check correct state
    if(pctx->state < UART_DFU_STATE_IDLE)
        return STM_DFU_ERROR_INVALID_STATE;

    // Check Length for validity (can't extend past flash end)
    if(start_address + num_bytes > pctx->pdev_info->flash_end)
        return STM_DFU_ERROR_INVALID_LENGTH;

    // Check for extended erase or not
    if(!pctx->use_extended_erase)
    {
        debug_error("Only extended erase is supported, lol.");
        return STM_DFU_ERROR_DEVICE_NOT_FOUND;
    }

    pctx->state = UART_DFU_STATE_ERASE_FLASH;

    uint16_t page_erase_code = 0x0000;

    // Check if we are doing a mass erase.
    int32_t chip_num_pages = (pctx->pdev_info->flash_end-pctx->pdev_info->flash_start) / pctx->pdev_info->page_size;
    int32_t pages_to_erase = (end_page - start_page + 1);

    if(chip_num_pages == pages_to_erase)
    {
        debug_printf("Global erase.");
        page_erase_code = STM_DFU_ERASE_CODE_GLOBAL_ERASE;
    }
    else
    {
        debug_printf("Erasing %u pages from 0x%08X.", pages_to_erase, start_address);
        page_erase_code = pages_to_erase;
    }

    // Send extended erase command
    /********* Command EX ERASE ********************************************/
    uint8_t* p = pctx->buffer;
    pctx->buffer[0] = STM_DFU_CMD_EX_ERASE;
    pctx->buffer[1] = ~pctx->buffer[0];

    _stm_dfu_device_send_(pctx, pctx->buffer, 2, NON_BLOCKING_INTERFACE_TX);

    // Wait for response. A start and finish ACK
    if(_stm_dfu_timeout_on_acks(pctx, 1) == false)
        return STM_DFU_ERROR_TIMEOUT;

    debug_printf("Got ACK on EX ERASE Command");

    // Send two bytes N, number of pages to erase.
    // N = 0xFFFY, where Y is from 0 to F means special erase
    // 0xFFFF global mass erase
    // 0xFFFE bank 1 mass erase
    // 0xFFFD bank 2 mass erase

    // Special erase?
    if(page_erase_code == STM_DFU_ERASE_CODE_GLOBAL_ERASE)
    {
        p = pctx->buffer;
        p += uint16_big_encode(page_erase_code, p); 
        *(p++) = _crc_xor_8(pctx->buffer, p-pctx->buffer);

        _stm_dfu_device_send_(pctx, pctx->buffer, p - pctx->buffer, NON_BLOCKING_INTERFACE_TX);

        // Wait for response.
        if(_stm_dfu_timeout_on_acks(pctx, 1) == false)
            return STM_DFU_ERROR_TIMEOUT;
    }
    else
    {      
        // Not a special erase
        // Encode the number of pages to erase minus 1.
        p = pctx->buffer;
        p += uint16_big_encode((pages_to_erase - 1), p);  

        // Encode page index to erase and the checksum of the length and number of pages.
        for(int i = 0; i < pages_to_erase; i++)
        {
            p += uint16_big_encode((start_page + i), p);
        }
        
        // CRC of block
        *(p++) = _crc_xor_8(pctx->buffer, p-pctx->buffer);

        _stm_dfu_device_send_(pctx, pctx->buffer, p - pctx->buffer, NON_BLOCKING_INTERFACE_TX);
        debug_print_buffer(pctx->buffer, p-pctx->buffer, 0, 16);

        // Wait for response.
        if(_stm_dfu_timeout_on_acks(pctx, 1) == false)
            return STM_DFU_ERROR_TIMEOUT;
    }

    debug_printf("Erase completed!");
    pctx->state = UART_DFU_STATE_IDLE;

    return STM_DFU_NO_ERROR;
}


/**
 * @brief Write data to the MCU's flash region.
 * 
 * @param pctx DFU context
 * @param start_address memory address to write data to. Must be in the valid flash region
 * @param num_bytes Number of bytes to write (number of bytes contained at p_data)
 * @param p_data Pointer to data that should be written
 * @return uint32_t error code / result code based on or state of the uart DFU context
 */
uint32_t stm_uart_dfu_write_flash(stm_uart_dfu_ctx* pctx, uint32_t start_address, uint32_t num_bytes, uint8_t * p_data)
{
    uint32_t retval = STM_DFU_NO_ERROR;

    // Check correct state
    if(pctx->state < UART_DFU_STATE_IDLE)
        return STM_DFU_ERROR_INVALID_STATE;

    // Okay, we are in correct state. 
    // Check start address for validity.
    if(start_address < pctx->pdev_info->flash_start)
        return STM_DFU_ERROR_INVALID_ADDRESS;

    // Check Length for validity (can't extend past flash end)
    if(start_address + num_bytes > pctx->pdev_info->flash_end)
        return STM_DFU_ERROR_INVALID_LENGTH;

    // Check data length is a multiple of 4
    if(num_bytes % 4 != 0)
        return STM_DFU_ERROR_INVALID_LENGTH;

    // Okay everything's ok.
    pctx->cmd_write_addr = start_address;
    pctx->cmd_bytes_to_write = num_bytes;
    pctx->state = UART_DFU_STATE_WRITE_FLASH;

    uint32_t bytes_written = 0;

    debug_printf("Writing %u bytes to flash at 0x%08X", pctx->cmd_bytes_to_write, pctx->cmd_write_addr);

    // Execute successive writes until all the data is written.
    while(pctx->cmd_bytes_to_write)
    {
        /********* Command Write ********************************************/
        uint8_t* p = pctx->buffer;
        pctx->buffer[0] = STM_DFU_CMD_WRITE;
        pctx->buffer[1] = ~pctx->buffer[0];

        // debug_print_buffer(pctx->buffer, 2, 0, 16);

        _stm_dfu_device_send_(pctx, pctx->buffer, 2, NON_BLOCKING_INTERFACE_TX);

        // Wait for ACK response.
        if(_stm_dfu_timeout_on_acks(pctx, 1) == false)
            return STM_DFU_ERROR_TIMEOUT;

        /********* Write Address ********************************************/
        p = pctx->buffer;
        p += uint32_big_encode(pctx->cmd_write_addr, p);
        *(p++) = _crc_xor_8(pctx->buffer, p-pctx->buffer);

        // debug_print_buffer(pctx->buffer, p - pctx->buffer, 0, 16);

        _stm_dfu_device_send_(pctx, pctx->buffer, p-pctx->buffer, NON_BLOCKING_INTERFACE_TX);

        // Wait for ACK response.
        if(_stm_dfu_timeout_on_acks(pctx, 1) == false)
            return STM_DFU_ERROR_TIMEOUT;

        /********* Length and Data*******************************************/
        uint16_t chunk_length = 0;
        // THe max length of a write is 256.
        if(pctx->cmd_bytes_to_write > 256)
            chunk_length = 256;
        else
            chunk_length = pctx->cmd_bytes_to_write;
        
        // Encode number of bytes - 1, and the data
        p = pctx->buffer;
        *(p++) = (uint8_t)(chunk_length - 1);
        memcpy(p, p_data + bytes_written, chunk_length);
        p += chunk_length;
        *(p++) = _crc_xor_8(pctx->buffer, p - pctx->buffer);
        
        // Send
        // debug_print_buffer(pctx->buffer, p - pctx->buffer, 0, 16);
        _stm_dfu_device_send_(pctx, pctx->buffer, p-pctx->buffer, NON_BLOCKING_INTERFACE_TX);

        // Wait for response.
        if(_stm_dfu_timeout_on_acks(pctx, 1) == false)
            return STM_DFU_ERROR_TIMEOUT;

        debug_printf("Wrote %u B at 0x%08X", chunk_length, pctx->cmd_write_addr);

        // Update all the state variables so next time through the loop we are good to go
        bytes_written += chunk_length;
        pctx->cmd_bytes_to_write -= chunk_length;
        pctx->cmd_write_addr += chunk_length;
    }

    debug_printf("Write complete.");

    return retval;
}


/**
 * @brief Read data from the STM DFU flash at the location "start_address", and compare to p_verify if provided 
 * 
 * @param pctx context object
 * @param start_address memory address to read memory from. Must be in the valid flash region
 * @param num_bytes Number of bytes to read/compare
 * @param p_verify Pointer to verification data. NULL if no verify
 * @return uint32_t error code / result code based on compare result or state of the uart DFU context
 */
uint32_t stm_uart_dfu_read_flash(stm_uart_dfu_ctx* pctx, uint32_t start_address, uint32_t num_bytes, uint8_t * p_verify)
{
    uint32_t retval = STM_DFU_NO_ERROR;

