briches/OpenQuad2/fw/oq2/application/flight_app/esc_dfu/stm32_uart_dfu/stm32_uart_dfu.c
    // Check correct state
    if(pctx->state < UART_DFU_STATE_IDLE)
        return STM_DFU_ERROR_INVALID_STATE;

    // Okay, we are in correct state. 
    // Check start address for validity.
    if(start_address < pctx->pdev_info->flash_start)
        return STM_DFU_ERROR_INVALID_ADDRESS;

    // Check Length for validity (can't extend past flash end)
    if(start_address + num_bytes > pctx->pdev_info->flash_end)
        return STM_DFU_ERROR_INVALID_LENGTH;

    // Okay everything's ok.
    pctx->cmd_read_addr = start_address;
    pctx->cmd_bytes_to_read = num_bytes;
    pctx->state = UART_DFU_STATE_READ_FLASH;

    uint32_t verified_bytes_count = 0;

    debug_printf("Reading %u bytes from flash at 0x%08X", pctx->cmd_bytes_to_read, pctx->cmd_read_addr);

    while(pctx->cmd_bytes_to_read)
    {
        /********* Command READ ********************************************/
        uint8_t* p = pctx->buffer;
        pctx->buffer[0] = STM_DFU_CMD_READ;
        pctx->buffer[1] = ~pctx->buffer[0];

        _stm_dfu_device_send_(pctx, pctx->buffer, 2, NON_BLOCKING_INTERFACE_TX);

        // Wait for response. A start and finish ACK
        if(_stm_dfu_timeout_on_acks(pctx, 1) == false)
            return STM_DFU_ERROR_TIMEOUT;

        /********* Read Address ********************************************/
        uint32_t addr = pctx->cmd_read_addr;

        p = pctx->buffer;

        // Encode address to read from.
        p += uint32_big_encode(addr, p);
        *(p++) = _crc_xor_8((p - 4), 4);

        _stm_dfu_device_send_(pctx, pctx->buffer, p-pctx->buffer, NON_BLOCKING_INTERFACE_TX);

        // Wait for response.
        if(_stm_dfu_timeout_on_acks(pctx, 1) == false)
            return STM_DFU_ERROR_TIMEOUT;

        /********* Read Num Bytes ********************************************/
        // Encode number of bytes to read
        if(pctx->cmd_bytes_to_read > 256)
            pctx->pending_rx_bytes = 256;
        else
            pctx->pending_rx_bytes = pctx->cmd_bytes_to_read;
        
        pctx->buffer[0] = (uint8_t)(pctx->pending_rx_bytes - 1);
        pctx->buffer[1] = ~pctx->buffer[0];

        _stm_dfu_device_send_(pctx, pctx->buffer, 2, NON_BLOCKING_INTERFACE_TX);

        // Wait for response.
        if(_stm_dfu_timeout_on_acks(pctx, 1) == false)
            return STM_DFU_ERROR_TIMEOUT;

        // Instead of resetting the byte count, we'll include the ACK in this receive. THis avoids a 
        // race depending on the baud rate

        // Here we should now receive the bytes.
        while (pctx->received_byte_count < pctx->pending_rx_bytes + 1)
            pctx->delay();

        // Skip the original ACK
        pctx->received_byte_count -= 1;

        // debug_printf("Got %u bytes", pctx->pending_rx_bytes);
        // debug_print_buffer(pctx->buffer + 1, pctx->received_byte_count, 0, 16);

        // IF we are doing a verify, check now.
        if(p_verify != NULL)
        {
            if(memcmp(p_verify + verified_bytes_count, pctx->buffer + 1, pctx->received_byte_count) != 0)
            {
                debug_error("Verify failed at 0x%08X.", pctx->cmd_read_addr);
                return STM_DFU_ERROR_UNKNOWN;
            }
            else
                debug_printf("Verified %u B at 0x%08X", pctx->pending_rx_bytes, pctx->cmd_read_addr);
            
            verified_bytes_count += pctx->received_byte_count;
        }

        // Check if we are doing another read or not.
        pctx->cmd_bytes_to_read -= pctx->pending_rx_bytes;

        // debug_printf("Rx %u B, %u B remaining.", pctx->received_byte_count, pctx->cmd_bytes_to_read);

        if(!pctx->cmd_bytes_to_read)
        {
            // Break loop
            pctx->state = UART_DFU_STATE_IDLE;
            retval = STM_DFU_NO_ERROR;
            break;
        }
        else
            pctx->cmd_read_addr += pctx->pending_rx_bytes;
    }

    return retval;
}


uint32_t stm_uart_dfu_start_app(stm_uart_dfu_ctx* pctx)
{
    // Check correct state
    if(pctx->state < UART_DFU_STATE_IDLE)
        return STM_DFU_ERROR_INVALID_STATE;

    /********* Command Go ********************************************/
    uint8_t* p = pctx->buffer;
    pctx->buffer[0] = STM_DFU_CMD_GO;
    pctx->buffer[1] = ~pctx->buffer[0];

    _stm_dfu_device_send_(pctx, pctx->buffer, 2, NON_BLOCKING_INTERFACE_TX);

    // Wait for response.
    if(_stm_dfu_timeout_on_acks(pctx, 1) == false)
        return STM_DFU_ERROR_TIMEOUT;


    /********* Jump Address ********************************************/
    uint32_t addr = pctx->pdev_info->flash_start;

    p = pctx->buffer;

    // Encode address to read from.
    p += uint32_big_encode(addr, p);
    *(p++) = _crc_xor_8((p - 4), 4);

    _stm_dfu_device_send_(pctx, pctx->buffer, p-pctx->buffer, NON_BLOCKING_INTERFACE_TX);

    // Wait for response.
    if(_stm_dfu_timeout_on_acks(pctx, 1) == false)
        return STM_DFU_ERROR_TIMEOUT;

    debug_printf("Succesfully started app.");   
}
